from aiogram import types, Router
from aiogram.filters import Command
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton

from bot import bot
from utils.logger import write_user_log
from utils.database import get_all_user_ids

from decorators.admin_only import admin_only

router = Router()


@router.message(Command("update"))
@admin_only
async def select_update(message: types.Message):

    update_message = (
        "🎓 <b>Бот обновился!</b> 🚀\n\n"
        "Теперь у нас ещё больше возможностей и полезных функций для студентов. 💫\n\n"

        "👥 <b>Друзья</b>\n"
        "Добавляйте друг друга в друзья прямо в боте, чтобы не потеряться! 🤝\n"
        "Теперь можно смотреть, когда у друзей день рождения 🎂, их вишлисты 🎁 "
        "и даже узнавать, из какой они группы 📘.\n\n"

        "🎉 <b>Рассылка поздравлений</b>\n"
        "Бот теперь рассылает уведомления о днях рождения друзей, а также предупреждает "
        "за неделю до праздника, чтобы вы успели подготовиться! 🗓️🎁\n\n"

        "📅 <b>Расписание</b>\n"
        "Старосты теперь могут сами выбирать время рассылки расписания — "
        "с <b>18:00 до 6:00</b>. 🕕\n"
        "Так вы сможете получать расписание тогда, когда удобно вашей группе.\n\n"

        "⚙️ <b>Как начать</b>\n"
        "Если вы староста — добавьте бота в группу и зарегистрируйтесь командой <b>/init</b>.\n"
        "Остальные — просто проверьте обновлённое меню, оно стало ещё проще и понятнее! ✨\n\n"

        "🏆 Удачи в этом семестре и приятного пользования ботом!"
    )

    user_ids = get_all_user_ids()

    successful = 0
    failed = 0

    for user_id in user_ids:
        try:
            await bot.send_message(
                chat_id=user_id,
                text=update_message,
                parse_mode="HTML",
                reply_markup=get_inline_keyboard()
            )
            successful += 1
        except Exception as e:
            msg = f"Не удалось отправить сообщение пользователю с ID {user_id}: {e}"
            write_user_log(msg)
            failed += 1

    # Подтверждение для администратора
    await message.answer(
        f"📢 Рассылка завершена.\n✅ Успешно отправлено: {successful}\n❌ Ошибки: {failed}"
    )


def get_inline_keyboard() -> InlineKeyboardMarkup:
    return InlineKeyboardMarkup(inline_keyboard=[
        [InlineKeyboardButton(text="Перейти в меню ➡️", callback_data="start")]
    ])